#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/d2c5b5b1-d8df-4dbd-ac14-d347e7ab31b0/resourceGroups/rg-iac-approva1-d2c5b5b1]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/d2c5b5b1-d8df-4dbd-ac14-d347e7ab31b0/resourceGroups/rg-iac-approva1-d2c5b5b1/providers/Microsoft.Storage/storageAccounts/storagedatest1d2c5b5b1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.main must be replaced
-/+ resource "azurerm_resource_group" "main" {
      ~ id       = "/subscriptions/d2c5b5b1-d8df-4dbd-ac14-d347e7ab31b0/resourceGroups/rg-iac-approva1-d2c5b5b1" -> (known after apply)
      ~ name     = "rg-iac-approva1-d2c5b5b1" -> "rg-iac-approva123-d2c5b5b1" # forces replacement
        tags     = {
            "Costcenter"  = "Damien123"
            "environment" = "Production"
            "project"     = "IaC-Demo"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.main must be replaced
-/+ resource "azurerm_storage_account" "main" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ enable_https_traffic_only          = true -> (known after apply)
      ~ https_traffic_only_enabled         = true -> (known after apply)
      ~ id                                 = "/subscriptions/d2c5b5b1-d8df-4dbd-ac14-d347e7ab31b0/resourceGroups/rg-iac-approva1-d2c5b5b1/providers/Microsoft.Storage/storageAccounts/storagedatest1d2c5b5b1" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
      ~ name                               = "storagedatest1d2c5b5b1" -> "storagedaprodd2c5b5b1" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://storagedatest1d2c5b5b1.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "storagedatest1d2c5b5b1.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://storagedatest1d2c5b5b1.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "storagedatest1d2c5b5b1.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://storagedatest1d2c5b5b1.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "storagedatest1d2c5b5b1.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "eastus" -> (known after apply)
      ~ primary_queue_endpoint             = "https://storagedatest1d2c5b5b1.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "storagedatest1d2c5b5b1.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://storagedatest1d2c5b5b1.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "storagedatest1d2c5b5b1.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://storagedatest1d2c5b5b1.z13.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "storagedatest1d2c5b5b1.z13.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "rg-iac-approva1-d2c5b5b1" -> "rg-iac-approva123-d2c5b5b1" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "Costcenter"  = "Damien123"
            "environment" = "Production"
            "project"     = "IaC-Demo"
            "resource"    = "storage-account"
        }
        # (18 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days                     = (known after apply)
              + permanent_delete_enabled = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }

      + static_website {
          + error_404_document = (known after apply)
          + index_document     = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ resource_group_name           = "rg-iac-approva1-d2c5b5b1" -> "rg-iac-approva123-d2c5b5b1"
  ~ storage_account_blob_endpoint = "https://storagedatest1d2c5b5b1.blob.core.windows.net/" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Kihan15, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*